Autodesk.Revit.DB.Plumbing.PipingSystemType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.MEPSystemClassification,System.String)
Creates a new instance of a piping system type and adds it to the document.
ADoc:
The document where the element will be created and added.
systemClassification:
The classification for the piping system type to be created
name:
The name of the piping system type to be created.
Returns:
The newly created piping system type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The system classification is not valid for the domain of this system type.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidType
Fluid Type
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: fluidTypeId is not a fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidTemperature
Fluid Temperature, in Kelvin.
Since:
2012